In [142]:
import pandas as pd
import numpy as np
import math

In [85]:
df = pd.read_csv("data.csv")
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

# null values

In [86]:
w = pd.isnull(df['Calories'])
df[w]

     Duration  Pulse  Maxpulse  Calories
17         45     90       112       NaN
27         60    103       132       NaN
91         45    107       137       NaN
118        60    105       125       NaN
141        60     97       127       NaN

In [87]:
w = pd.notnull(df['Calories'])
df[w]

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [92]:
df.fillna(0)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [93]:
df = df.replace(to_replace = np.nan, value = 0)
df.count()

Duration    169
Pulse       169
Maxpulse    169
Calories    169
dtype: int64

In [96]:
df = df.replace(to_replace = 0, value = np.nan)
df.count()

Duration    169
Pulse       169
Maxpulse    169
Calories    164
dtype: int64

In [94]:
df.isnull()

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [97]:
df.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [43]:
dict = {'First Score':[100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, np.nan, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
dfw = pd.DataFrame(dict)
dfw.dropna(how = 'all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

In [98]:
dict = {'First Score':[100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, np.nan, 80, 98],
        'Fourth Score':[60, 67, 68, 65]}
dfw = pd.DataFrame(dict)
dfw.dropna(axis = 1)

   Fourth Score
0            60
1            67
2            68
3            65

# pandas map, apply, applymap

In [130]:
dfw = pd.DataFrame({
    'name': ['James', 'Jane', 'Melissa', 'Ed', 'Neil'],
    'age': [30, 40, 32, 67, 43],
    'score': ['90%', '95%', '100%', '82%', '87%'],
    'age_missing_data': [30, 40, 32, 67, np.nan],
    'income':[100000, 80000, 55000, 62000, 120000]
})
dfw

      name  age score  age_missing_data  income
0    James   30   90%              30.0  100000
1     Jane   40   95%              40.0   80000
2  Melissa   32  100%              32.0   55000
3       Ed   67   82%              67.0   62000
4     Neil   43   87%               NaN  120000

In [131]:
genders = {'James': 'Male', 'Jane': 'Female', 'Melissa': 'Female', 'Ed': 'Male', 'Neil': 'Male'}
dfw['gender'] = dfw['name'].map(genders)
dfw

      name  age score  age_missing_data  income  gender
0    James   30   90%              30.0  100000    Male
1     Jane   40   95%              40.0   80000  Female
2  Melissa   32  100%              32.0   55000  Female
3       Ed   67   82%              67.0   62000    Male
4     Neil   43   87%               NaN  120000    Male

In [128]:
dfw.drop(['gender'], axis=1, inplace=True)
dfw

      name  age score  age_missing_data  income
0    James   30   90%              30.0  100000
1     Jane   40   95%              40.0   80000
2  Melissa   32  100%              32.0   55000
3       Ed   67   82%              67.0   62000
4     Neil   43   87%               NaN  120000

In [133]:
last_names = pd.Series(['Doe', 'Miller', 'Edwards', 'Nelson', 'Raul'], index=dfw['name'])
dfw['last name'] = dfw['name'].map(last_names)
dfw

      name  age score  age_missing_data  income  gender last name
0    James   30   90%              30.0  100000    Male       Doe
1     Jane   40   95%              40.0   80000  Female    Miller
2  Melissa   32  100%              32.0   55000  Female   Edwards
3       Ed   67   82%              67.0   62000    Male    Nelson
4     Neil   43   87%               NaN  120000    Male      Raul

In [134]:
dfw.drop(['last name'], axis=1, inplace=True)
dfw

      name  age score  age_missing_data  income  gender
0    James   30   90%              30.0  100000    Male
1     Jane   40   95%              40.0   80000  Female
2  Melissa   32  100%              32.0   55000  Female
3       Ed   67   82%              67.0   62000    Male
4     Neil   43   87%               NaN  120000    Male

In [138]:
dfww = pd.DataFrame({'A': [1, 2], 'B': [10, 20]}, index=['w', 'ww'])
dfww = dfww.apply(lambda x: x * x)
dfww

    A    B
w   1  100
ww  4  400

In [139]:
dfww = pd.DataFrame({'A': [1, 2], 'B': [10, 20]}, index=['w', 'ww'])
dfww = dfww.apply(np.sum, axis = 1)
dfww

w     11
ww    22
dtype: int64

In [140]:
dfww = pd.DataFrame({'A': [1, 2], 'B': [10, 20]}, index=['w', 'ww'])
dfww = dfww.apply(np.sum, axis = 0)
dfww

A     3
B    30
dtype: int64

In [145]:
dfww = pd.DataFrame({'A': [1, 4], 'B': [100, 400]})
dfww = dfww.applymap(math.sqrt)
dfww

     A     B
0  1.0  10.0
1  2.0  20.0

In [148]:
dfww = pd.DataFrame({'Name': ['Pankaj', 'Meghna'], 'Role': ['ceo', 'cto']})
dfww = dfww.applymap(str.upper)
dfww

     Name Role
0  PANKAJ  CEO
1  MEGHNA  CTO

# Detect and filter outliers.

# Perform Vectorized String operations on Pandas Series.

In [162]:
data = ['w w', 'ww ww', 'www www']
names = pd.Series(data)
names

0        w w
1      ww ww
2    www www
dtype: object

In [155]:
names.str.lower()

0      w
1     ww
2    www
dtype: object

In [156]:
names.str.upper()

0      W
1     WW
2    WWW
dtype: object

In [157]:
names.str.capitalize()

0      W
1     Ww
2    Www
dtype: object

In [159]:
names.str.len()

0    1
1    2
2    3
dtype: int64

In [163]:
names.str.startswith('w')

0    True
1    True
2    True
dtype: bool

In [164]:
names.str.endswith('w')

0    True
1    True
2    True
dtype: bool

In [165]:
names.str.split()

0        [w, w]
1      [ww, ww]
2    [www, www]
dtype: object

https://jakevdp.github.io/PythonDataScienceHandbook/03.10-working-with-strings.html

# Implement regularized Linear regression.

In [173]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn import preprocessing, svm
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn import datasets

In [206]:
data = datasets.load_breast_cancer()
data.feature_names

array(['mean radius', 'mean texture', 'mean perimeter', 'mean area',
       'mean smoothness', 'mean compactness', 'mean concavity',
       'mean concave points', 'mean symmetry', 'mean fractal dimension',
       'radius error', 'texture error', 'perimeter error', 'area error',
       'smoothness error', 'compactness error', 'concavity error',
       'concave points error', 'symmetry error',
       'fractal dimension error', 'worst radius', 'worst texture',
       'worst perimeter', 'worst area', 'worst smoothness',
       'worst compactness', 'worst concavity', 'worst concave points',
       'worst symmetry', 'worst fractal dimension'], dtype='<U23')

In [198]:
linear = LinearRegression()